; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v5 ?v13)
             (pred_7 ?v9 ?v7)
             (pred_10 ?v5 ?v7)
             (pred_4 ?v8 ?v5 )
	     (pred_1 ?v5)
             (pred_2 ?v10)
             (pred_12 ?v9)
             (pred_3 ?v7)
             (pred_11 ?v5)
             (pred_9 ?v9)
             (pred_5 ?v5)
             (pred_8 ))



(:action op_1
:parameters (?v4 ?v6 ?v12 ?v1)
:precondition (and (pred_2 ?v4) (pred_2 ?v6) (pred_12 ?v12) (pred_3 ?v1)
          (pred_6 ?v4 ?v6) (pred_7 ?v12 ?v1)
                   (pred_10 ?v6 ?v1) (pred_1 ?v4) 
                   (pred_11 ?v6) (pred_9 ?v12))
:effect (and  (pred_5 ?v6) (not (pred_11 ?v6))))


(:action op_3
:parameters (?v4 ?v2)
:precondition (and (pred_2 ?v4) (pred_2 ?v2)
               (pred_1 ?v4) (pred_6 ?v4 ?v2) (pred_5 ?v2))
:effect (and (pred_1 ?v2) (not (pred_1 ?v4))))

(:action op_4
:parameters (?v4 ?v12)
:precondition (and (pred_2 ?v4) (pred_12 ?v12) 
                  (pred_1 ?v4) (pred_4 ?v12 ?v4) (pred_8 ))
:effect (and (pred_9 ?v12)
   (not (pred_4 ?v12 ?v4)) (not (pred_8 ))))


(:action op_5
:parameters (?v4 ?v11 ?v3)
:precondition (and (pred_2 ?v4) (pred_12 ?v11) (pred_12 ?v3)
                  (pred_1 ?v4) (pred_9 ?v3) (pred_4 ?v11 ?v4))
:effect (and (pred_9 ?v11) (pred_4 ?v3 ?v4)
        (not (pred_9 ?v3)) (not (pred_4 ?v11 ?v4))))

(:action op_2
:parameters (?v4 ?v12)
:precondition (and (pred_2 ?v4) (pred_12 ?v12) 
                  (pred_1 ?v4) (pred_9 ?v12))
:effect (and (pred_8 ) (pred_4 ?v12 ?v4) (not (pred_9 ?v12)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_26 obj_15 obj_24 obj_29 obj_09 obj_16 obj_14 obj_20 obj_03 obj_18 obj_08 obj_25 obj_17 obj_01 obj_06 obj_13 obj_05 obj_10 obj_19 obj_23 obj_11 obj_21 obj_02 obj_07 obj_30
    obj_28 obj_27
    obj_04 obj_22 obj_12
    )

    (:init
       (pred_8)

       (pred_2 obj_26)
       (pred_2 obj_15)
       (pred_2 obj_24)
       (pred_2 obj_29)
       (pred_2 obj_09)
       (pred_2 obj_16)
       (pred_2 obj_14)
       (pred_2 obj_20)
       (pred_2 obj_03)
       (pred_2 obj_18)
       (pred_2 obj_08)
       (pred_2 obj_25)
       (pred_2 obj_17)
       (pred_2 obj_01)
       (pred_2 obj_06)
       (pred_2 obj_13)
       (pred_2 obj_05)
       (pred_2 obj_10)
       (pred_2 obj_19)
       (pred_2 obj_23)
       (pred_2 obj_11)
       (pred_2 obj_21)
       (pred_2 obj_02)
       (pred_2 obj_07)
       (pred_2 obj_30)
       (pred_3 obj_28)
       (pred_3 obj_27)
       (pred_12 obj_04)
       (pred_12 obj_22)
       (pred_12 obj_12)

       (pred_6 obj_26 obj_16)
       (pred_6 obj_26 obj_15)
       (pred_6 obj_15 obj_14)
       (pred_6 obj_15 obj_24)
       (pred_6 obj_15 obj_26)
       (pred_6 obj_24 obj_20)
       (pred_6 obj_24 obj_29)
       (pred_6 obj_24 obj_15)
       (pred_6 obj_29 obj_03)
       (pred_6 obj_29 obj_09)
       (pred_6 obj_29 obj_24)
       (pred_6 obj_09 obj_18)
       (pred_6 obj_09 obj_29)
       (pred_6 obj_16 obj_08)
       (pred_6 obj_16 obj_14)
       (pred_6 obj_16 obj_26)
       (pred_6 obj_14 obj_25)
       (pred_6 obj_14 obj_20)
       (pred_6 obj_14 obj_15)
       (pred_6 obj_14 obj_16)
       (pred_6 obj_20 obj_17)
       (pred_6 obj_20 obj_03)
       (pred_6 obj_20 obj_24)
       (pred_6 obj_20 obj_14)
       (pred_6 obj_03 obj_01)
       (pred_6 obj_03 obj_18)
       (pred_6 obj_03 obj_29)
       (pred_6 obj_03 obj_20)
       (pred_6 obj_18 obj_06)
       (pred_6 obj_18 obj_09)
       (pred_6 obj_18 obj_03)
       (pred_6 obj_08 obj_13)
       (pred_6 obj_08 obj_25)
       (pred_6 obj_08 obj_16)
       (pred_6 obj_25 obj_05)
       (pred_6 obj_25 obj_17)
       (pred_6 obj_25 obj_14)
       (pred_6 obj_25 obj_08)
       (pred_6 obj_17 obj_10)
       (pred_6 obj_17 obj_01)
       (pred_6 obj_17 obj_20)
       (pred_6 obj_17 obj_25)
       (pred_6 obj_01 obj_19)
       (pred_6 obj_01 obj_06)
       (pred_6 obj_01 obj_03)
       (pred_6 obj_01 obj_17)
       (pred_6 obj_06 obj_23)
       (pred_6 obj_06 obj_18)
       (pred_6 obj_06 obj_01)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_13 obj_05)
       (pred_6 obj_13 obj_08)
       (pred_6 obj_05 obj_21)
       (pred_6 obj_05 obj_10)
       (pred_6 obj_05 obj_25)
       (pred_6 obj_05 obj_13)
       (pred_6 obj_10 obj_02)
       (pred_6 obj_10 obj_19)
       (pred_6 obj_10 obj_17)
       (pred_6 obj_10 obj_05)
       (pred_6 obj_19 obj_07)
       (pred_6 obj_19 obj_23)
       (pred_6 obj_19 obj_01)
       (pred_6 obj_19 obj_10)
       (pred_6 obj_23 obj_30)
       (pred_6 obj_23 obj_06)
       (pred_6 obj_23 obj_19)
       (pred_6 obj_11 obj_21)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_21 obj_02)
       (pred_6 obj_21 obj_05)
       (pred_6 obj_21 obj_11)
       (pred_6 obj_02 obj_07)
       (pred_6 obj_02 obj_10)
       (pred_6 obj_02 obj_21)
       (pred_6 obj_07 obj_30)
       (pred_6 obj_07 obj_19)
       (pred_6 obj_07 obj_02)
       (pred_6 obj_30 obj_23)
       (pred_6 obj_30 obj_07)
       (pred_11 obj_30)
       (pred_11 obj_10)
       (pred_11 obj_02)
       (pred_10  obj_30 obj_28)
       (pred_10  obj_10 obj_27)
       (pred_10  obj_02 obj_27)
       (pred_5 obj_26)
       (pred_5 obj_15)
       (pred_5 obj_24)
       (pred_5 obj_29)
       (pred_5 obj_09)
       (pred_5 obj_16)
       (pred_5 obj_14)
       (pred_5 obj_20)
       (pred_5 obj_03)
       (pred_5 obj_18)
       (pred_5 obj_08)
       (pred_5 obj_25)
       (pred_5 obj_17)
       (pred_5 obj_01)
       (pred_5 obj_06)
       (pred_5 obj_13)
       (pred_5 obj_05)
       (pred_5 obj_19)
       (pred_5 obj_23)
       (pred_5 obj_11)
       (pred_5 obj_21)
       (pred_5 obj_07)

       (pred_7  obj_04 obj_28)
       (pred_7  obj_22 obj_27)
       (pred_7  obj_12 obj_27)
       (pred_4 obj_04 obj_06)
       (pred_4 obj_22 obj_24)
       (pred_4 obj_12 obj_08)
       (pred_1 obj_19)
    )

    (:goal (and
       (pred_4 obj_22 obj_25)
       (pred_4 obj_12 obj_06)
    ))
(:constraints
  (always (not (pred_1 obj_17)))
)
)

; plan
1. (op_3 obj_19 obj_01)
   deleted: (pred_1 obj_19)
   added: (pred_1 obj_01)
   goals met: 0 of 2
2. (op_3 obj_01 obj_03)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_03)
   goals met: 0 of 2
3. (op_3 obj_03 obj_20)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_20)
   goals met: 0 of 2
4. (op_3 obj_20 obj_14)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_14)
   goals met: 0 of 2
5. (op_3 obj_14 obj_25)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_25)
   goals met: 0 of 2
6. (op_3 obj_25 obj_08)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_08)
   goals met: 0 of 2
7. (op_4 obj_08 obj_12)
   deleted: (pred_4 obj_12 obj_08) (pred_8)
   added: (pred_9 obj_12)
   goals met: 0 of 2
8. (op_3 obj_08 obj_25)
   deleted: (pred_1 obj_08)
   added: (pred_1 obj_25)
   goals met: 0 of 2
9. (op_2 obj_25 obj_12)
   deleted: (pred_9 obj_12)
   added: (pred_8) (pred_4 obj_12 obj_25)
   goals met: 0 of 2
10. (op_3 obj_25 obj_14)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_14)
   goals met: 0 of 2
11. (op_3 obj_14 obj_20)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_20)
   goals met: 0 of 2
12. (op_3 obj_20 obj_24)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_24)
   goals met: 0 of 2
13. (op_4 obj_24 obj_22)
   deleted: (pred_4 obj_22 obj_24) (pred_8)
   added: (pred_9 obj_22)
   goals met: 0 of 2
14. (op_3 obj_24 obj_20)
   deleted: (pred_1 obj_24)
   added: (pred_1 obj_20)
   goals met: 0 of 2
15. (op_3 obj_20 obj_14)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_14)
   goals met: 0 of 2
16. (op_3 obj_14 obj_25)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_25)
   goals met: 0 of 2
17. (op_5 obj_25 obj_12 obj_22)
   deleted: (pred_9 obj_22) (pred_4 obj_12 obj_25)
   added: (pred_9 obj_12) (pred_4 obj_22 obj_25)
   goals met: 1 of 2
18. (op_3 obj_25 obj_14)
   deleted: (pred_1 obj_25)
   added: (pred_1 obj_14)
   goals met: 1 of 2
19. (op_3 obj_14 obj_20)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_20)
   goals met: 1 of 2
20. (op_3 obj_20 obj_03)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_03)
   goals met: 1 of 2
21. (op_3 obj_03 obj_18)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_18)
   goals met: 1 of 2
22. (op_3 obj_18 obj_06)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_06)
   goals met: 1 of 2
23. (op_5 obj_06 obj_04 obj_12)
   deleted: (pred_9 obj_12) (pred_4 obj_04 obj_06)
   added: (pred_9 obj_04) (pred_4 obj_12 obj_06)
   goals met: 2 of 2
